{
  "Services": {
    "Type": "Services",
    "desc": "欢迎申请使用本公司提供的在线手机网络游戏服务，为了保障用户的权益，请在同意参加手机网络版游戏软件商业运营前，详细阅读手机网络版游戏软件用户条款(以下简称《条款》)所有内容。本《条款》系由用户与本公司就本手机网络版游戏产品及服务所订立的协议。\n        当用户在线点击“立即注册”键时，则应视为用户已经详细阅读了本《条款》的内容，并同意遵守本合约的规定。\n        另外提醒用户，本《条款》之规定有时可能会更改，本《条款》一旦发生变动，将会在该款手机网络游戏的重要页面上提示修改内容。如果用户不同意本公司修改的内容，用户可以主动取消获得的网络服务。如果用户在修改内容公告后15天内未主动取消服务，则视为接受条款的变更；修改内容公告后用户如果仍继续使用本公司提供的产品和服务亦构成对条款变更的接受。\n         \n        第一条 游戏说明\n        本《条款》所述手机网络游戏分别代指本公司推出的各款多人在线手机网络游戏，各款手机网络游戏均独立适用本《条款》约束。本用户条款的目的是规范游戏用户注册、使用账号，参与本网络游戏等各项行为。\n        用户可以根据本条款以及本公司不时更新和公布的其他规则(包括但不限于本公司在官方网站上公布GM服务政策、外挂处理流程、盗号处理流程等)使用本公司提供的产品和服务。\n        用户有权在使用本公司提供的产品和服务的期间监督本公司及本公司的工作人员是否按照本公司所公布的标准向用户提供产品和服务，也可以随时向本公司提出与本公司的产品和服务有关意见和建议。\n         \n        第二条 资费政策\n        有关产品和服务的收费标准、购买方式等信息本公司将会放置在该产品和服务网页的相应位置。\n        本公司将有权决定本公司所提供的产品和服务的资费标准和收费方式，本公司可能会就不同的产品和服务制定不同的资费标准和收费方式，也可能按照本公司所提供的产品和服务的不同阶段确定不同的资费标准和收费方式。\n         \n        第三条 用户账号\n        1.账号的用途\n        a)用户可以注册一个或几个账号用于参加本手机网游。\n        b)用户进行账号登录后方可参加本手机网游。\n        c)用户通过微信支付或者其他方式进行账号充值。\n        2.账号的取得\n        a)用户必须完全同意全部用户条款并完成注册程序。\n        b)用户注册成功，得到一个会员账号和一个密码，即可成为本手机网络游戏的正式成员。\n        c)注册过程中，用户应按照相关游戏界面上的要求输入正确的个人基本资料。\n        3.账号的修改\n        a)为保障用户的权益且账号的唯一性，用户无法自行修改自己的账号。\n        b)用户可随时修改密码。\n        c)用户账号信息发生变更而未及时修改，导致无法证明用户的有效身份，本公司有权拒绝提供任何信息或承担任何义务。\n        4.账号的保护\n        a)用户应妥善保管自己的账号和密码，并对自己的账号和密码安全负全部责任。\n        b)用户若发现任何非法使用的账号或存在安全漏洞的情况，请立即通知本公司。\n        c)若本公司发现疑似遭盗用的账号，将立即终止该账号的使用权。\n        d)因考虑到用户的密码安全，用户的密码均采用加密算法进行保存，除用户自己外我公司人员均不知道用户的密码，若用户遗忘密码，可通过平台提供的“找回密码”功能，找回密码。\n        e)若因为用户自身原因，而导致账号、密码遭他人非法使用时，本公司将不负责处理。用户自身原因包括但不限于：任意向第三者透露账号和密码及所有注册资料；多人共享同一个账号；安装非法或来路不明的程序等。\n        5.账号的制裁\n        本公司将按照本《条款》及相关服务政策、外挂处理流程、盗号处理流程等具体规定，对违反该些游戏管理规定的玩家给予账号制裁。\n        6.账号的删除\n        用户同意在用户有下列情况下，本公司可以删除用户注册的账号，终止向用户提供产品和服务：\n        a)违反本合约的规定。\n        b)提供虚假注册信息。\n        c)通过非法手段、不正当手段或其他不公平的手段使用本公司的产品和服务或参与本公司活动。\n        d)有损害本公司正当利益的行为。\n        e)有严重损害其他用户的行为。\n        f)有违反中华人民共和国的法律、法规的行为或言论。\n        g)有违背社会风俗、社会道德和互联网一般道德和礼仪的行为。\n        h)用户注册的账号连续90天没有上线该款手机网络游戏且从未对该账号充值，则自第90天当天的24时起，本公司有权采取措施删除该款网络游戏账号，包括但不限于注册信息、等级信息、角色信息、物品信息等一切与该注册账号相关的信息，且不对该账号因删除所导致的任何利益损失负责。\n        用户注册的账号连续180天没有上线该款手机网络游戏(包时用户自包时到期日起计算)且在此期间没有对该款网络游戏充值，则自第180天当天的24时起，本公司有权采取措施删除该款网络游戏账号，包括但不限于注册信息、等级信息、角色信息、物品信息等一切与该注册账号相关的信息，且不对该账号因删除所导致的任何利益损失负责。\n        用户注册账号下的任一角色连续180天没有进入游戏世界，则自第180天当天的24时起，本公司有权采取措施删除该角色，包括但不限于等级信息、物品信息等一切与该角色相关的信息，且不对该角色因删除所导致的任何利益损失负责。\n        用户注册的账号连续180天没有上线该手机款网络游戏(包时用户自包时到期日起计算)且没有对该款网络游戏充值，则自第180天当天的24时起，本公司有权采取措施取消账号上剩余的该款手机网络游戏点数（含游戏点数所对应的游戏时间及可用于购买游戏道具的游戏金币，下同），被取消的游戏点数将不予任何补偿。但如果用户在本公司取消上述游戏点数之日起的30天内向该款网络游戏账号进行价值人民币15元以上（包含15元）的成功充值，本公司将另外向该款手机网络游戏账号赠送和上述取消措施中用户被取消的游戏点数相等额的游戏点数。\n        i)其他妨碍本公司提供产品和服务或本公司认为的严重不当行为。\n        本公司因上述原因删除用户注册的账号后即不再对用户承担任何义务和责任。\n         \n        第四条 本公司的义务\n        1.本公司通过手机互联网络为用户提供手机网络游戏服务。\n        2.对于用户注册过程中登记的个人资料，本公司同意在未获得用户同意以前，不对外揭露，但以下情况除外：\n        a)相应的政府机关、司法机关的要求；\n        b)现行的法律法规的要求；\n        c)本公司合理怀疑用户有危害国家安全或其他违法情形，本公司主动将相关资料供公安机关调查处理；\n        d)为保障本公司权益；\n\n        第五条 用户的义务\n        用户应：\n        1.自行配备游戏的所需设备。\n        2.自行负担游戏内所支付的与此服务相关的电话费用、网络使用费用。\n        3.提供详尽、准确的个人资料并不断更新个人资料。如果因为用户提供的资料包含有不正确的信息，导致用户不能正常使用该款手机网络游戏，本公司不承担任何责任。\n        4.遵守游戏公约、玩家守则(包括但不限于本公司在官方网站上公布GM服务政策、外挂处理流程、盗号处理流程等)。\n        5.遵守中华人民共和国相关法律法规(如果用户是中华人民共和国境外的使用者，应遵守所属国家或地区的法律法规)。用户将自行承担用户所发布的信息内容的责任。特别地，用户不得发布下列内容：\n        (1)反对中华人民共和国宪法所确定的基本原则的；\n        (2)危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；\n        (3)损害国家荣誉和利益的；\n        (4)煽动民族仇恨、民族歧视，破坏民族团结的；\n        (5)破坏国家宗教政策，宣扬邪教和封建迷信的；\n        (6)散布谣言，扰乱社会秩序，破坏社会稳定的；\n        (7)散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；\n        (8)侮辱或者诽谤他人，侵害他人合法权益的；\n        (9)宣扬外挂,私服以及木马的相关内容；\n        (10)刊登任何经本公司合理判断为不妥当或者本公司未认可的软件、文件等在内的主页地址或者链接的行为；\n        (11)含有中华人民共和国法律、行政法规禁止的其他内容的。\n        6 用户不得通过不正当的手段或其他不公平的手段使用本公司的产品和服务或参与本公司活动。用户不得干扰本公司正常地提供产品和服务，包括但不限于：攻击、侵入本公司的网站服务器或使网站服务器过载；破解、修改本公司提供的客户端程序；攻击、侵入本公司的游戏服务器或游戏服务器端程序或使游戏服务器过载；制作、发布、传播、使用任何形式的妨碍游戏公平性的辅助工具或程序(外挂)；利用程序的漏洞和错误(Bug)破坏游戏的正常进行或传播该漏洞或错误(Bug)；不合理地干扰或阻碍他人使用本公司所提供的产品和服务。\n        为维护游戏的公平性，如果本公司发现用户数据异常，无论用户对该异常数据产生是否负有过错，本公司均有权根据本《条款》、游戏公约、玩家守则及后期不时发布的游戏公告等，采取相应措施：包括但不限于对该账号的冻结、终止、删除；用户在此承诺本公司有权作出上述行为，并承诺不就上述行为要求本公司做任何补偿或退费。\n        本公司在此特别提示用户：\n        基于软件产品本身的特殊性及本《条款》责任限制条款所述，尽管本公司将尽最大努力解决已知的漏洞和错误（Bug），但用户知道或应该知道本产品仍可能包含未知的漏洞和错误（Bug）等。\n        由于虚拟物品之间的交易（本公司已特别承诺要求用户不得参加虚拟物品与真实货币或者物品的交易行为）存在一定的风险（包括但不限于虚拟物品因复制等数据异常而可能被删除；国家现阶段法律对其价值认定仍处于空白等），用户在交易过程中应对交易方及交易物品尽审慎注意义务，除非该交易系依照本公司书面明确指示为之，本公司将不对该交易中产生的任何问题进行支持和保障。\n         \n        第六条 服务的中断、停止\n        为了网站的正常运行，本公司需要定期或不定期地对网站进行停机维护，因此类情况而造成的正常服务中断、停止，用户应该予以理解，本公司则有义务尽力避免服务中断、停止或将中断、停止时间限制在最短时间内；\n        发生下列情形之一时，本公司有权停止或中断游戏服务器所提供之服务，对因此而产生的不便或损害，本公司对用户或第三人均不承担任何责任：\n        a)定期检查或施工，更新软硬件等，本公司有权暂停服务，但本公司会尽快完成维护、更新工作；\n        b)服务器遭受损坏，无法正常运作；\n        c)突发性的软硬件设备与电子通信设备故障；\n        d)网路提供商线路或其它故障；\n        e)在紧急情况之下为维护国家安全或其它会员及第三者之人身安全；\n        f)不可抗力及其他第三方原因。\n        除前款所述情形外，用户同意本公司享有通过在提前1个月本手机网络游戏官方网站公告通知的方式中断或终止部分或全部网络服务的权利，用户已明确知晓上述权利的授予且知晓因上述权利的行使可能给自身及其他第三方造成的直接或间接利益减损，用户在此明确表示不追究本公司因行使上述单方中断或终止服务权利而可能导致的一切责任。\n        本公司在此特别提示用户：本网络游戏所含虚拟物品系为增加游戏乐趣而设置，并随游戏的停止运营而消失，用户一经获得将不得以任何形式退还给本公司。鉴于网络游戏的特殊性质，虚拟物品仅在游戏的运营期内有效。\n         \n        第七条 责任限制\n        对于本公司的产品和服务，本公司仅作下述有限保证，该有限保证取代任何文档、包装、或其他资料中的任何其他明示或默示的保证(如果有)。\n        本公司仅以 \"现有状况且包含所有错误\"的形式提供相关的产品、软件或程序及任何支持服务，并仅保证(1)本公司所提供的产品和服务能基本符合本公司正式公布的要求，(2)本公司所提供的相关产品和服务基本与本公司正式公布的服务承诺相符，(3)本公司仅在商业上允许的合理范围内尽力解决本公司在提供产品和服务过程中所遇到的任何问题。\n        在适用法律允许的最大范围内，本公司明确表示不提供任何其他类型的保证，不论是明示的或默示的，包括但不限于适销性、适用性、可靠性、准确性、完整性、无病毒以及无错误的任何默示保证和责任。\n        另外，在适用法律允许的最大范围内，本公司并不担保本公司所提供的产品和服务一定能满足用户的要求，也不担保提供的产品和服务不会被中断，并且对产品和服务的及时性，安全性，出错发生，以及信息是否能准确，及时，顺利的传送均不作任何担保。\n        在适用法律允许的最大范围内，本公司不就因用户使用本公司的产品和服务引起的，或在任何方面与本公司的产品和服务有关的任何意外的、非直接的、特殊的、或间接的损害或请求(包括但不限于因人身伤害、因隐私泄漏、因未能履行包括诚信或合理谨慎在内的任何责任、因过失和因任何其他金钱上的损失或其他损失而造成的损害赔偿)承担任何责任。\n        用户在本手机网络游戏官方网站上所表达的观点、建议和其它内容均为用户本人看法，不代表本公司的观点。\n        本公司保留采取包括但不限于合并服务器等形式以达到服务器资源优化利用的权利，如发生上述情形，本公司有义务保障用户资料的完整性。\n         \n        第八条 变更\n        本公司有权在必要时修改用户条款、游戏公约和玩家守则。本公司的用户条款、游戏公约和玩家守则一旦发生变动，将会在该款手机网络游戏的重要页面上提示修改内容。如果用户不同意本公司修改的内容，用户可以主动取消获得的网络服务。如果用户在修改内容公告后15天内未主动取消服务，则视为接受条款的变更；修改内容公告后用户如果仍继续使用本公司提供的产品和服务亦构成对条款变更的接受。\n        \n        \n        第九条 知识产权\n        1.本款手机网络游戏官方网站上所有的作品及资料，其著作权、专利权、商标专用权、商业秘密权及其它知识产权，均为本公司或授权本公司使用的合法权利人所有，除非事先经本公司或其权利人的合法授权，任何人皆不得擅自以任何形式使用，否则本公司可立即终止向用户提供产品和服务，并依法追究其法律责任，赔偿本公司一切损失。\n        2.未经本公司授权，任何人不得擅自复制、反编译(de-compile)、反汇编(disassemble)任何功能或程序，不得对任何功能和或程序进行反向工程(reverse engineering)。\n\n        第十条 通知\n        本公司所有发给用户的通知可通过重要页面的公告或电子邮件或常规的信件传送。\n         \n        第十一条 授权\n        用户原创作品上载、传送、输入或以其他方式提供至该款手机网络游戏官方网站时，视为用户除保留署名权外，其他著作权均转让本公司；本公司可使用、修改、编辑、复制、公开播送、发行上述作品，并可将前述权利转/分授权他人；用户授权本公司行使上述行为所必需的一切权利，包括但不限于著作权、肖像权等。\n         \n        第十二条 纠纷\n        1.本用户条款适用中华人民共和国的法律。\n        2.如本公司服务条款与中华人民共和国法律相抵触时，则这些条款将完全按法律规定重新解释，而其它条款法律效力不变。\n        3.如出现纠纷，用户和本公司一致同意交由公司所在地法院管辖。"
  },
  "Privacy": {
    "Type": "Privacy",
    "desc": "欢乐情怀麻将游戏（含新华网出品旗下子公司、分公司及关联公司，下同）尊重并保护所有使用新华网出品网络服务用户的个人隐私权。为了给您提供更准确、更个性化的服务，新华网出品会按照本隐私权政策的规定使用和披露您的个人信息。但新华网出品将以高度的勤勉、审慎义务对待这些信息。除本隐私权政策另有规定外，在未征得您事先许可的情况下，新华网出品不会将这些信息对外披露或向第三方提供。新华网出品会不定时更新本隐私权政策，相关内容变更后，如果您继续使用本服务，即视为您已接受修改后的相关内容。如果您不接受修改后的相关内容，应当停止使用相关服务。您在同意新华网出品络服务使用协议之时，即视为您已经同意本隐私权政策全部内容。本隐私权政策属于新华网出品络服务使用协议不可分割的一部分。\n\n        1.适用范围\n        a)在您注册欢乐情怀麻将游戏帐号时，您根据欢乐情怀麻将游戏要求提供的个人注册信息（商家应法律法规要求需公示的企业名称及相关工商注册信息除外）；\n        b)在您使用欢乐情怀麻将游戏网络服务，欢乐情怀麻将游戏自动接收并记录的您的设备上的信息，包括但不限于您的IP地址、使用的语言、访问日期和时间、软硬件特征信息等数据；\n        c)欢乐情怀麻将游戏通过合法途径从商业伙伴处取得的用户个人数据。\n        \n        您了解并同意，以下信息不适用本隐私权政策：\n        a)您在使用欢乐情怀麻将游戏平台提供的搜索服务时输入的关键字信息；\n        b)欢乐情怀麻将游戏收集到的您在欢乐情怀麻将游戏发布的有关信息数据，包括但不限于参与活动、成交信息及评价详情；\n        c)违反法律规定或违反欢乐情怀麻将游戏规则行为及欢乐情怀麻将游戏已对您采取的措施。\n        　　\n        2.信息使用\n        a)欢乐情怀麻将游戏不会向任何无关第三方提供、出售、出租、分享或交易您的个人信息，除非事先得到您的许可，或该第三方和欢乐情怀麻将游戏（含欢乐情怀麻将游戏关联公司）单独或共同为您提供服务，且在该服务结束后，其将被禁止访问包括其以前能够访问的所有这些资料。\n        b)欢乐情怀麻将游戏亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播您的个人信息。任何欢乐情怀麻将游戏平台用户如从事上述活动，一经发现，欢乐情怀麻将游戏有权立即终止与该用户的服务协议。\n        c)为服务用户的目的，欢乐情怀麻将游戏可能通过使用您的个人信息，向您提供您感兴趣的信息，包括但不限于向您发出产品和服务信息，或者与欢乐情怀麻将游戏合作伙伴共享信息以便他们向您发送有关其产品和服务的信息。\n        \n        3.信息披露\n        在如下情况下，欢乐情怀麻将游戏将依据您的个人意愿或法律的规定全部或部分的披露您的个人信息：\n        a)经您事先同意，向第三方披露；\n        b)为提供您所要求的产品和服务，而必须和第三方分享您的个人信息；\n        c)根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；\n        d)如您出现违反中国有关法律、法规或者欢乐情怀麻将游戏服务协议或相关规则的情况，需要向第三方披露；\n        e)如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；\n        f)在欢乐情怀麻将游戏平台上创建的某一交易中，如交易任何一方履行或部分履行了交易义务并提出信息披露请求的，欢乐情怀麻将游戏有权决定向该用户提供其交易对方的联络方式等必要信息，以促成交易的完成或纠纷的解决。\n        g)其它欢乐情怀麻将游戏根据法律、法规或者网站政策认为合适的披露。\n        \n        4.信息存储和交换\n        欢乐情怀麻将游戏收集的有关您的信息和资料将保存在欢乐情怀麻将游戏及（或）其关联公司的服务器上，这些信息和资料可能传送至您所在国家、地区或欢乐情怀麻将游戏收集信息和资料所在地的境外并在境外被访问、存储和展示。\n        \n        5.信息安全\n        a)欢乐情怀麻将游戏帐号均有安全保护功能，请妥善保管您的用户名及密码信息。欢乐情怀麻将游戏将通过对用户密码进行加密等安全措施确保您的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请您注意在信息网络上不存在“完善的安全措施”。\n        b)在使用欢乐情怀麻将游戏网络服务进行网上交易时，您不可避免的要向交易对方或潜在的交易对方披露自己的个人信息，如联络方式或者邮政地址。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是欢乐情怀麻将游戏用户名及密码发生泄露，请您立即联络欢乐情怀麻将游戏客服，以便欢乐情怀麻将游戏采取相应措施。"
  }
}